# GetRelinquishOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions..::..GetRelinquishOptions Method
SynchronizeWithCentralOptions Class See Also
---
Gets the options which govern whether or not to relinquish elements and workset types.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RelinquishOptions GetRelinquishOptions()
```

Visual Basic
---
```text
Public Function GetRelinquishOptions As RelinquishOptions
```

Visual C++
---
```text
public:
RelinquishOptions^ GetRelinquishOptions()
```

# ### Return Value
The options. If nullNothingnullptra null reference (Nothing in Visual Basic), synchronize with central will relinquish the current user's ownership of all worksets and all elements.
# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace